[Glaive_CV X2WeaponTemplate]
FriendlyName="长戟"
FriendlyNamePlural="长戟"
BriefSummary="长戟是一种大型近战武器,能够造成范围性近战伤害,但将牺牲一定的敏捷性."
TacticalText="<Bullet/>不像剑,长戟能够同时攻击一个区域内的敌人.<br/><Bullet/>长戟很笨重导致其不能冲刺攻击,但是有多种近战模式弥补其不足.<br/><Bullet/>留意外星人的科技,其中或许有加强长戟的好东西."
AbilityDescName="长戟"

[Glaive_MG X2WeaponTemplate]
FriendlyName="电弧长戟"
FriendlyNamePlural="电弧长戟"
BriefSummary="融合了电弧科技,电弧长戟更加致命,甚至有几率眩晕敌人."
TacticalText="<Bullet/>电弧长戟使用闪电立场进行攻击,伤害更高切能眩晕敌人.<br/><Bullet/>长戟很笨重导致其不能冲刺攻击,但是有多种近战模式弥补其不足."
AbilityDescName="长戟"

[Glaive_BM X2WeaponTemplate]
FriendlyName="聚变长戟"
FriendlyNamePlural="聚变长戟"
BriefSummary="聚变长戟使用电浆融合科技,伤害敌人的同时能够将其点燃."
TacticalText="<Bullet/>这是一种恐怖的武器.<br/><Bullet/>长戟很笨重导致其不能冲刺攻击,但是有多种近战模式弥补其不足."
AbilityDescName="长戟"

[Glaive_Chosen X2WeaponTemplate]
FriendlyName="驱逐者"
FriendlyNamePlural="驱逐者"
BriefSummary="基于从天选者手上获得的遗产设计图,我们现在有能力实现一种新的武器系统.这是长老们所构想的一种独特武器,拥有强大的远程与近战功能,并且对非灵能的目标将造成毁灭性的打击."
TacticalText="<Bullet/>这种特殊的长戟可以自由的使用远程攻击,并对非灵能单位造成暴击."
AbilityDescName="长戟"

[Glaive_Chosen X2TechTemplate]
DisplayName="可选武器项目:长戟"
Summary="集齐所有天选者的传承后，如今已能实现长老曾期望的全新武器系统。这柄长戟无论远近皆具强大威力，只需一挥，便能无视距离击溃敌人。"

[MassiveMeleeWeapon X2AbilityTemplate]
LocFriendlyName="重型近战武器"
LocHelpText="额外消耗弹药且必定命中的近战攻击。若士兵上一回合未移动，还会对周围造成额外范围伤害。"
LocLongDescription="额外消耗弹药且必定命中的近战攻击。若士兵上一回合未移动，还会对周围造成额外范围伤害。"

[MassiveMeleeWeapon_Chosen X2AbilityTemplate]
LocFriendlyName="逆因果之刃"
LocHelpText="所有攻击均会造成额外范围伤害，且攻击消耗弹药、必定命中。"
LocLongDescription="所有攻击均会造成额外范围伤害，且攻击消耗弹药、必定命中。"

[PrimaryGlaive X2AbilityTemplate]
LocFriendlyName="内置枪械长戟"
LocHelpText="作为主武器装备时，将解锁近战警戒与远程射击功能，且对 4 格范围内的敌人触发近战警戒攻击。"
LocLongDescription="作为主武器装备时，将解锁近战警戒与远程射击功能，且对 4 格范围内的敌人触发近战警戒攻击。"

[GlaiveCloseCombat X2AbilityTemplate]
LocFriendlyName="长戟警戒攻击：穿刺"
LocLongDescription="任何进入近战范围或从近战范围发起攻击的敌人，都会触发免费的长戟攻击。"
LocHelpText="任何进入近战范围或从近战范围发起攻击的敌人，都会触发免费的长戟攻击。"
LocFlyOverText="穿刺"
LocPromotionPopupText="<Bullet/> 若敌人在相邻格子开始其回合，当该敌人试图攻击时，将触发反击。<br/><Bullet/> 若敌人未在相邻格子开始其回合，则当该敌人移动至近战范围时，将触发反击。"

[GlaivePassiveRend X2AbilityTemplate]
LocFriendlyName="额外攻击：挥砍"
LocFlyOverText="额外攻击：挥砍"
LocLongDescription="用长戟攻击相邻目标（必定命中）"
LocHelpText="用长戟攻击相邻目标（必定命中）"
LocPromotionPopupText="<Bullet/> 用长戟攻击相邻目标（必定命中）"

[ChosenGlaivePassiveRend X2AbilityTemplate]
LocFriendlyName="额外攻击：浪潮（挥砍 + 横扫）"
LocFlyOverText="额外攻击：浪潮（挥砍 + 横扫）"
LocLongDescription="用长戟攻击目标（必定命中）"
LocHelpText="用长戟攻击目标（必定命中）"
LocPromotionPopupText="<Bullet/> 用长戟攻击相邻目标（必定命中）"

[GlaivePassiveSwipe X2AbilityTemplate]
+LocFriendlyName="横扫"
+LocLongDescription="可使用长戟攻击数米外的敌人。"
+LocHelpText="用长戟对目标进行近距离横扫攻击。"
+LocFlyOverText="横扫"

[GlaiveShot X2AbilityTemplate]
LocFriendlyName="长戟射击"
LocHelpText="向目标发射长戟内置枪械子弹。"
LocLongDescription="使用主武器射击后，总是结束回合。"

[DualGlaiveShot X2AbilityTemplate]
LocFriendlyName="长戟射击（双持）"
LocHelpText="向目标发射双持长戟内置枪械子弹。"
LocLongDescription="使用主武器射击后，总是结束回合。"

[GlaiveOverwatch X2AbilityTemplate]
LocFriendlyName="长戟警戒射击"
LocHelpText="在下一回合前，用长戟穿刺进入近战范围移动或攻击的敌人。"
LocLongDescriptionWhenConcealed="在下一回合前，用长戟穿刺进入近战范围移动或攻击的敌人"
LocFlyOverText="警戒射击（长戟）"

[DualGlaiveOverwatch X2AbilityTemplate]
LocFriendlyName="长戟警戒射击"
LocHelpText="在下一回合前，用长戟穿刺进入近战范围移动或攻击的敌人。"
LocLongDescriptionWhenConcealed="在下一回合前，用长戟穿刺进入近战范围移动或攻击的敌人"
LocFlyOverText="警戒射击（长戟）"

[GlaiveReload X2AbilityTemplate]
+LocFriendlyName="长戟装弹"
+LocLongDescription="为长戟装弹，以重置额外攻击次数与反击次数。"
+LocHelpText="为长戟装弹，以更新额外攻击次数与反击次数。"

[GlaiveOverwatchMove X2AbilityTemplate]
+LocFriendlyName="长戟警戒射击：可移动"
+LocFlyOverText="长戟警戒射击：可移动"

;; 未使用技能列表 —— 计划通过独立模组实现
[GlaiveRend X2AbilityTemplate]
LocFriendlyName="挥砍"
LocFlyOverText="挥砍"
LocLongDescription="用长戟攻击相邻目标（必定命中）"
LocHelpText="用长戟攻击相邻目标（必定命中）"
LocPromotionPopupText="<Bullet/> 用长戟攻击相邻目标（必定命中）"

[GlaiveSwipe X2AbilityTemplate]
+LocFriendlyName="横扫"
+LocLongDescription="可使用长戟攻击数米外的敌人。"
+LocHelpText="用长戟对目标进行近距离横扫攻击。"
+LocFlyOverText="横扫"

[DualGlaiveRend X2AbilityTemplate]
LocFriendlyName="双持挥砍"
LocFlyOverText="双持挥砍"
LocLongDescription="用长戟攻击相邻目标（必定命中）"
LocHelpText="用长戟攻击相邻目标（必定命中）"
LocPromotionPopupText="<Bullet/> 用长戟攻击相邻目标（必定命中）"

[DualGlaiveSwipe X2AbilityTemplate]
+LocFriendlyName="双持横扫"
+LocLongDescription="可使用长戟攻击数米外的敌人。"
+LocHelpText="用长戟对目标进行近距离横扫攻击。"
+LocFlyOverText="双持横扫"


[DualGlaiveCloseCombat X2AbilityTemplate]
LocFriendlyName="双持穿刺"
LocLongDescription="任何进入近战范围或从近战范围发起攻击的敌人，都会触发免费的长戟攻击。"
LocHelpText="任何进入近战范围或从近战范围发起攻击的敌人，都会触发免费的长戟攻击。"
LocFlyOverText="双持穿刺"
LocPromotionPopupText="<Bullet/> 若敌人在相邻格子开始其回合，当该敌人试图攻击时，将触发反击。<br/><Bullet/> 若敌人未在相邻格子开始其回合，则当该敌人移动至近战范围时，将触发反击。"


[GlaiveReaper X2AbilityTemplate]
+LocFriendlyName="收割"
+LocLongDescription="使用长戟击杀敌人后，将返还行动点。"
+LocHelpText="使用长戟击杀敌人后，将返还行动点。"
+LocFlyOverText="收割"
